ПУМП/src/Catalogs/SK007/SK007.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SK007</name>
  <comment>Лицензии медицинской организации</comment>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>NUMBER</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LPU</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LPU_PODR</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_BEG</name>
    <comment>Дата начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_END</name>
    <comment>Дата окончания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>CODE_USL</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ПУМП/src/Catalogs/V003/V003.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>V003</name>
  <comment>Работы (услуги) при лицензировании медицинской помощи</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ID</name>
    <comment>ИД</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NAME</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IERARH</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IS_GROUP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_BEG</name>
    <comment>Дата начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_END</name>
    <comment>Дата окончания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Специальности</name>
    <attributes>
      <name>SPECIALMED</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Профили</name>
    <attributes>
      <name>PROFMEDHELP</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ПУМП/src/Catalogs/SK007/Forms/ФормаЭлемента/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьТаблицуУслуг(пСсылка)
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	SK007Услуги.CODE_USL КАК КодУслуги,
	|	V003.NAME КАК Услуга,
	|	SK007Услуги.НомерСтроки КАК НомерСтроки,
	|	V003.ID,
	|	V003.IERARH,
	|	V003.IS_GROUP,
	|	V003.DATE_BEG,
	|	V003.DATE_END
	|ИЗ
	|	Справочник.SK007.Услуги КАК SK007Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.V003 КАК V003
	|		ПО SK007Услуги.CODE_USL = V003.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.SK007 КАК SK007
	|		ПО SK007Услуги.Ссылка = SK007.Ссылка
	|ГДЕ
	|	SK007.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	Услуга ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("Ссылка",пСсылка);
	
	пРез=Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Возврат пРез;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	пТЗ=ПолучитьТаблицуУслуг(Объект.Ссылка);
	ЗначениеВРеквизитФормы(пТЗ,"ТЗУслуги");
	
КонецПроцедуры
